In [3]:
#1
def find_maximum(a,b):
    if a > b:
        return a
    else: #a<=b
        return b

In [59]:
find_maximum(a = 3, b = 5)

5

In [5]:
#2
# show_star(n) if n = 5, function print:
# *
# **
# ***
# ****
# *****
# if n = 2, function print:
# *
# **

In [6]:
print(2*'*')

**

In [10]:
# C1: su dung vong for
def show_stars(n):
    for i in range(1,n+1):
        print(i*'*')

In [13]:
show_stars(0)

In [14]:
# C2: su dung vong while
def show_stars(n):
    i = 1
    while i <= n:
        print(i*'*')
        i = i + 1

In [17]:
show_stars(8)

*
**
***
****
*****
******
*******
********

In [18]:
x = 10

In [23]:
#3
def fizz_buzz(n):
    if (n%3 == 0) and (n%5 == 0):
        return "FizzBuzz"
    elif n%3 == 0:
        return "Fizz"
    elif n%5 == 0:
        return "Buzz"
    else:
        return n

In [26]:
fizz_buzz()

'FizzBuzz'

In [27]:
# Library: a reusable piece of code
import pandas as pd
import os

In [28]:
# OS: operating system
os.getcwd()

'C:\\Users\\dat.nt'

In [30]:
os.chdir(r'C:\Users\dat.nt\PyTraining')

In [31]:
os.getcwd()

'C:\\Users\\dat.nt\\PyTraining'

In [32]:
df = pd.read_excel('country.xlsx')

In [33]:
df

          Country          Region
0         Vietnam  Southeast Asia
1        Malaysia  Southeast Asia
2       Singapore  Southeast Asia
3        Thailand  Southeast Asia
4           China       East Asia
5           Japan       East Asia
6           Spain          Europe
7  United Kingdom          Europe
8   United States   North America
9          Mexico   North America

In [37]:
df.iloc[4]

Country        China
Region     East Asia
Name: 4, dtype: object

In [39]:
# Indexing
sea_df = df[df['Region']=='Southeast Asia']

In [40]:
ea_df = df[df['Region']=='East Asia']
eu_df = df[df['Region']=='Europe']
na_df = df[df['Region']=='North America']

In [43]:
# & = and; | = or; ~ = not
asia_df = df[(df['Region']=='East Asia') | (df['Region']=='Southeast Asia')]

In [44]:
asia_df

     Country          Region
0    Vietnam  Southeast Asia
1   Malaysia  Southeast Asia
2  Singapore  Southeast Asia
3   Thailand  Southeast Asia
4      China       East Asia
5      Japan       East Asia

In [46]:
df[~(df['Region']=='North America')]

          Country          Region
0         Vietnam  Southeast Asia
1        Malaysia  Southeast Asia
2       Singapore  Southeast Asia
3        Thailand  Southeast Asia
4           China       East Asia
5           Japan       East Asia
6           Spain          Europe
7  United Kingdom          Europe

In [47]:
df[df['Region']!='North America']

          Country          Region
0         Vietnam  Southeast Asia
1        Malaysia  Southeast Asia
2       Singapore  Southeast Asia
3        Thailand  Southeast Asia
4           China       East Asia
5           Japan       East Asia
6           Spain          Europe
7  United Kingdom          Europe

In [48]:
asia_df.to_csv('output.csv')

In [50]:
writer = pd.ExcelWriter('output.xlsx', engine = 'xlsxwriter')
asia_df.to_excel(writer, sheet_name = 'asia', index = False)
eu_df.to_excel(writer, sheet_name = 'eu', index = False)
na_df.to_excel(writer, sheet_name = 'na', index = False)
writer.save()
writer.close()

In [55]:
out_df = pd.read_excel('output.xlsx', sheet_name = 'asia')

In [56]:
out_df

     Country          Region
0    Vietnam  Southeast Asia
1   Malaysia  Southeast Asia
2  Singapore  Southeast Asia
3   Thailand  Southeast Asia
4      China       East Asia
5      Japan       East Asia

In [57]:
eu_df = pd.read_excel('output.xlsx', sheet_name = 'eu')

In [58]:
eu_df

          Country  Region
0           Spain  Europe
1  United Kingdom  Europe